; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared0 - mode
	thermograph1 - mode
	thermograph2 - mode
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	GroundStation10 - direction
	GroundStation12 - direction
	Star14 - direction
	Star0 - direction
	GroundStation1 - direction
	Star11 - direction
	Star13 - direction
	GroundStation9 - direction
	GroundStation7 - direction
	Star5 - direction
	GroundStation3 - direction
	Star8 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Planet21 - direction
	Star22 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star11)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star13)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star8)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 Star5)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(have_image Phenomenon15 thermograph1)
	(have_image Planet16 thermograph1)
	(have_image Star17 thermograph1)
	(have_image Star18 thermograph2)
	(have_image Star19 infrared0)
	(have_image Planet20 thermograph2)
	(have_image Planet21 thermograph1)
	(have_image Star22 thermograph2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 9
2. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 9
3. (turn_to satellite1 phenomenon15 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 9
4. (take_image satellite1 phenomenon15 instrument3 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 1 of 9
5. (turn_to satellite1 planet16 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet16)
   goals met: 1 of 9
6. (take_image satellite1 planet16 instrument3 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 2 of 9
7. (turn_to satellite1 planet21 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet21)
   goals met: 2 of 9
8. (take_image satellite1 planet21 instrument3 thermograph1)
   added: (have_image planet21 thermograph1)
   goals met: 3 of 9
9. (turn_to satellite1 star17 planet21)
   deleted: (pointing satellite1 planet21)
   added: (pointing satellite1 star17)
   goals met: 3 of 9
10. (take_image satellite1 star17 instrument3 thermograph1)
   added: (have_image star17 thermograph1)
   goals met: 4 of 9
11. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 9
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 5 of 9
13. (turn_to satellite0 star13 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star13)
   goals met: 4 of 9
14. (calibrate satellite0 instrument1 star13)
   added: (calibrated instrument1)
   goals met: 4 of 9
15. (turn_to satellite0 groundstation2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 9
16. (turn_to satellite0 planet20 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet20)
   goals met: 4 of 9
17. (take_image satellite0 planet20 instrument1 thermograph2)
   added: (have_image planet20 thermograph2)
   goals met: 5 of 9
18. (turn_to satellite0 groundstation2 planet20)
   deleted: (pointing satellite0 planet20)
   added: (pointing satellite0 groundstation2)
   goals met: 6 of 9
19. (turn_to satellite0 star18 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star18)
   goals met: 5 of 9
20. (take_image satellite0 star18 instrument1 thermograph2)
   added: (have_image star18 thermograph2)
   goals met: 6 of 9
21. (turn_to satellite0 groundstation2 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 groundstation2)
   goals met: 7 of 9
22. (turn_to satellite0 star22 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star22)
   goals met: 6 of 9
23. (take_image satellite0 star22 instrument1 thermograph2)
   added: (have_image star22 thermograph2)
   goals met: 7 of 9
24. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 7 of 9
25. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 7 of 9
26. (turn_to satellite0 groundstation2 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 groundstation2)
   goals met: 8 of 9
27. (turn_to satellite0 groundstation9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation9)
   goals met: 7 of 9
28. (calibrate satellite0 instrument2 groundstation9)
   added: (calibrated instrument2)
   goals met: 7 of 9
29. (turn_to satellite0 groundstation2 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 groundstation2)
   goals met: 8 of 9
30. (turn_to satellite0 star19 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star19)
   goals met: 7 of 9
31. (take_image satellite0 star19 instrument2 infrared0)
   added: (have_image star19 infrared0)
   goals met: 8 of 9
32. (turn_to satellite0 groundstation2 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 groundstation2)
   goals met: 9 of 9
